from models.object_3d import Object3D

cube = Object3D(
    vertices=[(-3,-3,-3), (3,-3,-3), (3,3,-3), (-3,3,-3),
              (-3,-3,3),  (3,-3,3),  (3,3,3),  (-3,3,3)],
    faces=[(0,1,2,3), (4,5,6,7), (0,1,5,4), (1,2,6,5), (2,3,7,6), (3,0,4,7)],
    center_coord=(0, 7.5, 0),
)

pyramid = Object3D(
    vertices=[(-3,-3,-1.5), (3,-3,-1.5), (3,3,-1.5), (-3,3,-1.5),   # основание
              (0,0,4.5)],                                           # вершина
    faces=[(0,1,2,3),
           (0,1,4), (1,2,4), (2,3,4), (3,0,4)],
    center_coord=(0, 7.5, 0),
)


polygonObject = Object3D(
    vertices=[(0,10,5),(3,13,3),(-3,13,-3),(9,5,3),(9,5,-3),(3,5,-3)], 
    faces=[(0,1,2),(3,4,5)]
)

prism = Object3D(
    vertices=[(-3,-1.73,-3), (3,-1.73,-3), (0,3.46,-3),   # нижний треугольник
              (-3,-1.73,3),  (3,-1.73,3),  (0,3.46,3)],   # верхний треугольник
    faces=[(0,1,2), (3,4,5),
           (0,1,4,3), (1,2,5,4), (2,0,3,5)],
    center_coord=(0, 7.5, 0),
)